Cases/container/container_template_ground_solid/constant/airOutside/visibleFaceFaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       labelListList;
    location    "constant/airOutside";
    object      visibleFaceFaces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


208
(

35
(
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
)


35
(
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
)


36
(
10
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
)


11
(
110
111
112
128
129
139
140
141
142
155
156
)


13
(
6
51
110
111
112
128
129
139
140
141
142
155
156
)


37
(
10
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
4
51
)


40
(
4
44
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
5
41
47
51
)


35
(
41
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
)


40
(
57
61
97
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
38
51
)


37
(
25
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
98
)


37
(
2
5
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
)


38
(
19
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
41
47
95
)


37
(
57
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
22
)


38
(
25
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
16
19
)


18
(
27
28
41
44
51
66
67
110
111
112
128
129
139
140
141
142
155
156
)


37
(
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
25
27
51
)


17
(
25
28
41
51
110
111
112
128
129
139
140
141
142
155
156
13
21
)


38
(
37
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
19
28
47
)


35
(
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
19
)


35
(
11
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
)


36
(
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
36
)


13
(
26
37
110
111
112
128
129
139
140
141
142
155
156
)


37
(
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
8
12
)


42
(
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
14
15
38
42
97
99
16
)


37
(
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
51
72
)


41
(
9
13
16
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
18
14
15
)


13
(
21
110
111
112
128
129
139
140
141
142
155
156
16
)


37
(
14
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
29
41
)


36
(
14
16
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
)


36
(
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
14
27
)


38
(
44
97
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
45
)


35
(
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
)


11
(
110
111
112
128
129
139
140
141
142
155
156
)


34
(
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
)


34
(
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
)


43
(
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
44
49
57
61
81
97
98
76
)


11
(
110
111
112
128
129
139
140
141
142
155
156
)


36
(
17
21
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
)


41
(
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
23
30
39
44
45
63
)


37
(
52
110
111
112
113
115
117
118
120
122
123
125
127
128
129
131
134
139
140
141
142
143
145
147
149
151
153
154
155
156
157
159
161
162
164
166
38
)


12
(
51
110
111
112
128
129
139
140
141
142
155
156
)


41
(
7
14
16
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
27
29
42
50
)


34
(
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
)


36
(
110
111
112
114
116
119
121
124
126
128
129
130
132
133
135
136
137
138
139
140
141
142
144
146
148
150
152
155
156
158
160
163
165
167
50
109
)


27
(
6
14
30
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
)


26
(
52
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
30
)


24
(
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
)


27
(
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
6
11
17
42
)


23
(
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
)


26
(
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
9
35
)


25
(
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
37
43
)


27
(
4
14
16
40
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
)


27
(
39
45
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
36
)


25
(
67
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
66
)


26
(
69
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
99
)


25
(
86
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
)


25
(
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
64
80
)


25
(
12
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
)


26
(
64
66
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
67
)


26
(
62
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
70
)


27
(
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
66
67
80
91
)


24
(
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
)


28
(
59
69
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
70
99
)


25
(
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
38
)


24
(
58
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
)


25
(
80
91
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
)


27
(
14
58
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
91
68
)


26
(
14
53
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
58
)


34
(
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
)


37
(
54
62
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
)


36
(
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
98
)


38
(
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
70
93
94
)


12
(
120
122
125
127
131
134
151
153
154
166
24
63
)


14
(
88
89
197
198
199
200
201
202
203
204
205
206
207
84
)


37
(
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
84
87
94
)


38
(
80
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
90
95
96
)


37
(
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
35
82
)


36
(
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
89
)


15
(
197
198
199
200
201
202
203
204
205
206
207
73
79
84
89
)


14
(
197
198
199
200
201
202
203
204
205
206
207
78
87
88
)


37
(
75
91
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
56
)


36
(
93
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
)


37
(
83
93
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
)


36
(
82
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
)


39
(
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
73
78
87
94
95
)


36
(
91
96
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
)


38
(
55
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
88
99
)


17
(
197
198
199
200
201
202
203
204
205
206
207
73
74
78
79
84
89
)


15
(
73
94
197
198
199
200
201
202
203
204
205
206
207
79
86
)


38
(
73
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
87
94
78
)


35
(
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
75
)


39
(
65
80
85
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
66
74
)


36
(
93
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
)


39
(
81
82
92
97
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
)


12
(
88
197
198
199
200
201
202
203
204
205
206
207
)


41
(
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
11
68
73
75
84
90
96
)


35
(
85
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
)


42
(
8
12
30
61
69
92
93
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
)


42
(
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
61
69
70
81
82
92
93
)


23
(
197
198
199
200
201
202
203
204
205
206
207
23
35
54
57
61
62
69
70
86
101
105
107
)


35
(
107
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
)


36
(
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
102
)


12
(
197
198
199
200
201
202
203
204
205
206
207
101
)


34
(
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
)


34
(
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
)


38
(
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
99
100
109
)


12
(
107
197
198
199
200
201
202
203
204
205
206
207
)


40
(
100
106
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
12
69
92
)


37
(
113
115
117
118
120
122
123
125
127
131
134
143
145
147
149
151
153
154
157
159
161
162
164
166
197
198
199
200
201
202
203
204
205
206
207
55
101
)


35
(
114
116
119
121
124
126
130
132
133
135
136
137
138
144
146
148
150
152
158
160
163
165
167
197
198
199
200
201
202
203
204
205
206
207
105
)


48
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
111
128
140
155
)


48
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
110
128
140
155
)


44
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
)


47
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
76
77
81
82
83
86
92
93
97
98
101
105
107
108
)


44
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
)


47
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
76
77
81
82
83
86
92
93
97
98
101
105
107
108
)


44
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
)


47
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
76
77
81
82
83
86
92
93
97
98
101
105
107
108
)


47
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
76
77
81
82
83
86
92
93
97
98
101
105
107
108
)


45
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
132
)


51
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
123
134
154
)


44
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
)


48
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
)


51
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
76
77
81
82
83
86
92
93
97
98
101
105
107
108
120
131
134
151
)


44
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
)


49
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
166
)


45
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
133
)


49
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
166
)


46
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
110
111
)


44
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
)


44
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
)


51
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
123
149
154
)


47
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
119
135
163
)


47
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
126
137
150
)


51
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
120
123
154
)


45
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
132
)


44
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
)


45
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
133
)


44
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
)


44
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
)


46
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
110
111
)


44
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
)


44
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
)


48
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
)


44
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
)


48
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
)


44
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
)


48
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
)


44
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
)


48
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
76
77
81
82
83
86
92
93
97
98
101
105
107
108
131
)


45
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
133
)


49
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
123
)


44
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
)


48
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
)


51
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
120
131
134
)


47
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
110
111
156
)


45
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
155
)


47
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
76
77
81
82
83
86
92
93
97
98
101
105
107
108
)


44
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
)


48
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
)


44
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
)


48
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
)


48
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
)


46
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
132
167
)


48
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
)


44
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
)


50
(
0
1
2
8
9
10
12
13
20
22
23
24
25
30
31
35
38
39
44
45
46
49
52
54
55
57
59
61
62
63
69
70
71
72
76
77
81
82
83
86
92
93
97
98
101
105
107
108
125
127
)


45
(
5
6
7
11
15
17
18
19
27
28
29
33
34
37
41
42
43
47
48
50
51
53
56
58
60
64
65
66
67
68
74
75
80
84
85
89
90
91
95
96
100
103
104
109
163
)

0()
0()
0()
0()
0()
0()
7(175 178 191 192 193 194 195)
1(174)
0()
1(189)
1(174)
0()
3(191 193 195)
0()
0()
1(186)
0()
4(191 193 194 195)
1(183)
0()
0()
1(177)
0()
3(174 180 185)
2(174 195)
4(174 180 185 195)
3(174 185 195)
6(174 180 185 192 193 194)
0()

41
(
68
69
70
71
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
)


42
(
68
69
70
71
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
200
)


41
(
68
69
70
71
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
)


46
(
68
69
70
71
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
198
203
205
206
207
)


41
(
68
69
70
71
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
)


41
(
68
69
70
71
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
)


42
(
68
69
70
71
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
200
)


43
(
68
69
70
71
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
205
207
)


43
(
68
69
70
71
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
200
204
)


43
(
68
69
70
71
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
200
207
)


44
(
68
69
70
71
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
200
204
206
)

)


// ************************************************************************* //
